import{a as d,_ as a}from"./BuEifdDA.js";import{_}from"./CwT1cFDX.js";import{f as c,w as t,o as i,a as l,b as o,d as n}from"./lzqKbo0G.js";import"./DH30C75S.js";const r={class:"paragraph-container"},h={class:"paragraph-container"},p=l("h3",null,"لیست‌های نشانه‌دار (غیرترتیبی)",-1),f=l("code",{class:"code-bubble"},"-",-1),b=l("code",{class:"code-bubble"},"*",-1),m=l("code",{class:"code-bubble"},"+",-1),k=l("ul",null,[l("li",null,"آیتم اول"),l("li",null,[n("آیتم دوم"),l("ul",null,[l("li",null,"زیرآیتم اول"),l("li",null,"زیرآیتم دوم")])]),l("li",null,"آیتم سوم")],-1),x=l("ul",null,[l("li",null,"آیتم اول"),l("li",null,[n("آیتم دوم"),l("ul",null,[l("li",null,"زیرآیتم اول"),l("li",null,"زیرآیتم دوم")])]),l("li",null,"آیتم سوم")],-1),g={class:"paragraph-container"},L=l("ul",null,[l("li",null,"آیتم اول"),l("li",null,[n("آیتم دوم"),l("ul",null,[l("li",null,"زیرآیتم اول"),l("li",null,"زیرآیتم دوم")])]),l("li",null,"آیتم سوم")],-1),w={class:"paragraph-container"},v=l("h3",null,"لیست‌های شماره‌گذاری شده (ترتیبی)",-1),C=l("ol",null,[l("li",null,"مورد اول"),l("li",null,"مورد دوم"),l("li",null,"مورد سوم")],-1),M={class:"paragraph-container"},B=l("h3",null,"ترکیب لیست‌های ترتیبی و غیر ترتیبی",-1),N=l("ol",null,[l("li",null,"مورد اول"),l("li",null,[n("مورد دوم"),l("ul",null,[l("li",null,"زیرمورد غیر ترتیبی اول"),l("li",null,"زیرمورد غیر ترتیبی دوم")])]),l("li",null,"مورد سوم")],-1),y={class:"paragraph-container"},T=l("h3",null,"لیست وظایف (Task Lists)",-1),V=l("ul",null,[l("li",null,[l("input",{type:"checkbox",disabled:""}),n(" تسک اول")]),l("li",null,[l("input",{disabled:"",type:"checkbox",checked:""}),n(" تسک دوم")]),l("li",null,[l("input",{disabled:"",type:"checkbox"}),n(" تسک سوم")])],-1),D={class:"paragraph-container"},E=l("h3",null,"نکات تکمیلی",-1),I=l("strong",null,"تورفتگی مناسب:",-1),j=l("strong",null,"علامت‌های متفاوت:",-1),q=l("strong",null,"ترکیب لیست‌ها:",-1),z=`1. مورد اول
2. مورد دوم
    - زیرمورد غیر ترتیبی اول
    - زیرمورد غیر ترتیبی دوم
3. مورد سوم
`,A=`
    - آیتم اول
- آیتم دوم
  - زیرآیتم اول
  - زیرآیتم دوم
- آیتم سوم
`,F=`
    + آیتم اول
+ آیتم دوم
  + زیرآیتم اول
  + زیرآیتم دوم
+ آیتم سوم
`,G=`
    * آیتم اول
* آیتم دوم
  * زیرآیتم اول
  * زیرآیتم دوم
* آیتم سوم
`,H=`
1. مورد اول
2. مورد دوم
3. مورد سوم

    `,J=`- [ ] تسک اول
- [x] تسک دوم
- [ ] تسک سوم
`,W={__name:"Lists",setup(K){return(O,P)=>{const e=a,s=_,u=d;return i(),c(u,{"page-title":"لیست ها در Markdown"},{default:t(()=>[l("div",r,[o(e,null,{default:t(()=>[n(" Markdown به شما امکان ایجاد دو نوع لیست را می‌دهد: لیست‌های غیر ترتیبی (Bulleted Lists) و لیست‌های ترتیبی (Numbered Lists). هر یک از این لیست‌ها برای مقاصد خاصی مفید هستند و به شما کمک می‌کنند اطلاعات خود را به صورت منظم و خوانا نمایش دهید. ")]),_:1})]),l("div",h,[p,o(e,null,{default:t(()=>[n(" لیست‌های غیر ترتیبی برای مواردی که ترتیب آنها اهمیت ندارد، استفاده می‌شوند. برای ایجاد این نوع لیست، می‌توانید از علامت‌های "),f,n(" یا "),b,n(" یا "),m,n(" استفاده کنید. هر یک از این علامت‌ها را در ابتدای هر مورد قرار دهید. به طور مثال: "),o(s,{code:A},{default:t(()=>[k]),_:1})]),_:1}),o(e,null,{default:t(()=>[n("یا به این صورت :")]),_:1}),o(s,{code:F},{default:t(()=>[x]),_:1}),l("div",g,[o(e,null,{default:t(()=>[n("و یا به این صورت :")]),_:1})]),o(s,{code:G},{default:t(()=>[L]),_:1}),o(e,null,{default:t(()=>[n("میتونیم یک لیست بدون علامت یا در واقع unordered List در Markdown ایجاد کنیم")]),_:1})]),l("div",w,[v,o(e,null,{default:t(()=>[n(" لیست‌های ترتیبی در Markdown برای نمایش مواردی که دارای ترتیب خاصی هستند، مانند مراحل انجام یک کار، استفاده می‌شود. برای ایجاد لیست‌های ترتیبی، می‌توانید از اعداد و نقطه استفاده کنید. Markdown به طور خودکار اعداد را در ترتیب صحیح قرار می‌دهد، حتی اگر شما به ترتیب صحیح آنها را ننویسید. برای ایجاد لیست شماره‌گذاری شده از اعداد به همراه یک نقطه و یک فاصله استفاده می‌کنیم. مثال: ")]),_:1}),o(s,{code:H},{default:t(()=>[C]),_:1})]),l("div",M,[B,o(e,null,{default:t(()=>[n("شما همچنین می‌توانید لیست‌های ترتیبی را با لیست‌های غیر ترتیبی ترکیب کنید: ")]),_:1}),o(s,{code:z},{default:t(()=>[N]),_:1})]),l("div",y,[T,o(e,null,{default:t(()=>[n(" لیست وظایف (Task Lists) یک نوع لیست خاص در Markdown است که به شما امکان می‌دهد تا وضعیت انجام وظایف را نمایش دهید. این نوع لیست‌ها معمولاً در مستندات پروژه‌ها و ابزارهای مدیریت وظایف استفاده می‌شوند. ")]),_:1}),o(e,null,{default:t(()=>[n(" برای ایجاد لیست وظایف، از علامت چک‌باکس (checkbox) استفاده می‌شود. چک‌باکس‌ها با ترکیب یک جفت براکت ([ ]) برای وظایف انجام نشده و یک جفت براکت با علامت تیک ([x]) برای وظایف انجام شده نمایش داده می‌شوند. هر وظیفه در یک خط جداگانه نوشته می‌شود. به عنوان مثال: ")]),_:1}),o(s,{code:J},{default:t(()=>[V]),_:1})]),l("div",D,[E,o(e,null,{default:t(()=>[I,n(" برای زیرلیست‌ها، معمولاً از چهار فاصله استفاده می‌شود. اما می‌توانید بسته به نیاز خود از تعداد دیگری فاصله نیز استفاده کنید. ")]),_:1}),o(e,null,{default:t(()=>[j,n(" استفاده از علامت‌های مختلف در لیست‌های غیر ترتیبی تاثیری در نمایش آنها ندارد. همه به یک شکل نمایش داده می‌شوند. ")]),_:1}),o(e,null,{default:t(()=>[q,n(" ترکیب لیست‌های ترتیبی و غیر ترتیبی به شما امکان می‌دهد ساختارهای پیچیده‌تری ایجاد کنید که می‌تواند به خوانایی و سازمان‌دهی اطلاعات کمک کند. ")]),_:1})])]),_:1})}}};export{W as default};
