<template>
  <DocContainer page-title="کاربرد های Markdown">
    <div class="paragraph-container">
    </div>

  </DocContainer>
</template>


<script setup>
useSeoMeta({
  author:'محمد داداش رستمی',
  title:'راهنمای جامع Markdown - کاربرد های Markdown',
  ogTitle:'راهنمای جامع Markdown - کاربرد های Markdown',
  description:'مارک داون چیست ؟ در سال 2004 با این ایده که بتواند خواندن و نوشتن یک متن تحت وب را برای همه آسان کند و قابل تبدیل به خانواده HTML هم باشد به وجود آمد. از Markdown به عنوان یک استاندارد متن نویسی یاد می‌شود و بزرگترین مزیت این استاندارد استفاده از حروف ساده و کوتاه برای اهداف نگارشی (از جمله پررنگ کردن متن و .... ) می‌باشد',
  ogDescription:'مارک داون چیست ؟ در سال 2004 با این ایده که بتواند خواندن و نوشتن یک متن تحت وب را برای همه آسان کند و قابل تبدیل به خانواده HTML هم باشد به وجود آمد. از Markdown به عنوان یک استاندارد متن نویسی یاد می‌شود و بزرگترین مزیت این استاندارد استفاده از حروف ساده و کوتاه برای اهداف نگارشی (از جمله پررنگ کردن متن و .... ) می‌باشد',
  robots: 'index, follow',
  colorScheme:'dark light',
  charset:'utf-8'

})
</script>